
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПокупателя.Организация КАК Организация,
	               |	ЗаказПокупателя.Контрагент КАК Контрагент,
	               |	ЗаказПокупателя.Договор КАК Договор,
	               |	ЗаказПокупателя.СуммаДокумента КАК СуммаДокумента,
	               |	ЗаказПокупателя.Товары.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Товары,
	               |	ЗаказПокупателя.Услуги.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Услуги
	               |ИЗ
	               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	               |ГДЕ
	               |	ЗаказПокупателя.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	ТоварыОснования = Выборка.Товары.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Товары.Добавить(), ТоварыОснования);
	КонецЦикла;
	
	УслугиОснования = Выборка.Услуги.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Услуги.Добавить(), УслугиОснования);
	КонецЦикла;
	
	Основание = ДанныеЗаполнения;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ОбработкаЗаказов.Записывать = Истина;
	Движения.ОстаткиТоваров.Записывать = Истина;
	
	Движение = Движения.ОбработкаЗаказов.Добавить();
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Договор = Договор;
	Движение.Заказ = Основание;
	Движение.СуммаОтгрузки = СуммаДокумента;

	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

КонецПроцедуры

Процедура ВыполнитьАвтозаполнение()экспорт
		
		НАбонентскаяПлата =  Константы.ВКМ_НоменклатураАбонентскойПлаты.Получить();
		НРаботыСпециалиста = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
		
		Если Не ЗначениеЗаполнено (НАбонентскаяПлата.Наименование) или Не ЗначениеЗаполнено(НРаботыСпециалиста.Наименование) Тогда 
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Выберите правильный договор, Абонентское обслуживание.";
			Сообщение.Сообщить();
			
			Отказ = Истина;
		Иначе 
			ЭтотОбъект.Товары.Очистить();
			ЭтотОбъект.Услуги.Очистить(); 
			Если   ЗначениеЗаполнено (ЭтотОбъект.Договор.ВКМ_СуммаАбонентскойПлаты) Тогда
				НоваяСтрокаТовары = ЭтотОбъект.Товары.Добавить();
				НоваяСтрокаТовары.Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(НАбонентскаяПлата);
				НоваяСтрокаТовары.Сумма = ЭтотОбъект.Договор.ВКМ_СуммаАбонентскойПлаты; 
			КонецЕсли;
			
			Таблица =  ПолучитьДанныеПоСтоимостиИКоличеству();
			КолЧасов = Таблица.Колонки.Найти("КолЧасов");
			СуммаКОплате = Таблица.Колонки.Найти("СуммаКОплате");;
			Если ЗначениеЗаполнено(Таблица) и КолЧасов <> 0 и СуммаКОплате <> 0 Тогда
				НоваяСтрока = ЭтотОбъект.услуги.Добавить();
				НоваяСтрока.Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(НРаботыСпециалиста);
				Для Каждого СтрТаблица из Таблица цикл 
					НоваяСтрока.Количество = СтрТаблица.КолЧасов;
					НоваяСтрока.Сумма = СтрТаблица.СуммаКоплате;
					НоваяСтрока.Цена =  Окр(НоваяСтрока.Сумма/НоваяСтрока.Количество,2);
					
				КонецЦикла;
				
			ИначеЕсли Не ЗначениеЗаполнено(Таблица) Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Данных для заполнения табличной части нет";
				Сообщение.Сообщить();						
			КонецЕсли;
		КонецЕсли;
КонецПроцедуры

Функция ПолучитьДанныеПоСтоимостиИКоличеству()экспорт 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
		|	НАЧАЛОПЕРИОДА(ВКМ_ВыполненныеКлиентуРаботы.Период, МЕСЯЦ) КАК Период,
		|	НАЧАЛОПЕРИОДА(РеализацияТоваровУслуг.Дата, МЕСЯЦ) КАК ДатаДокРеализация,
		|	СУММА(ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботы.ВКМ_КоличествоЧасов, 0)) КАК КолЧасов,
		|	СУММА(ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботы.ВКМ_СуммаКОплате, 0)) КАК СуммаКОплате
		|ИЗ
		|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы КАК ВКМ_ВыполненныеКлиентуРаботы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО (НАЧАЛОПЕРИОДА(ВКМ_ВыполненныеКлиентуРаботы.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(РеализацияТоваровУслуг.Дата, МЕСЯЦ))
		|ГДЕ
		|	РеализацияТоваровУслуг.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТоваровУслуг.Ссылка,
		|	НАЧАЛОПЕРИОДА(ВКМ_ВыполненныеКлиентуРаботы.Период, МЕСЯЦ),
		|	НАЧАЛОПЕРИОДА(РеализацияТоваровУслуг.Дата, МЕСЯЦ)";
		
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ТЗ = РезультатЗапроса.Выгрузить();		
		Возврат ТЗ;	
		
	КонецФункции		
	


#КонецОбласти

#КонецЕсли
