
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроверитьДлительностьОтпуска(Команда)
	ПроверитьДлительностьОтпускаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПроверитьДлительностьОтпускаНаСервере() экспорт
	ОбъектДок =  РеквизитФормыВзначение("Объект"); 
	Данные = ОбъектДок.ПолучениеДанных();
	
	Если ЗначениеЗаполнено (Данные) Тогда  
		
		// Код для таблицы значений
		ОбъектДок = Объект.Ссылка.ПолучитьОбъект();
		Для Каждого СтрДанные из Данные Цикл 
			СотрудникСверка = СтрДанные.Сотрудник;
			
			Для Каждого ТекущаяСтрока Из ОбъектДок.ОтпускаСотрудников Цикл 
				ЭлементУО = УсловноеОформление.Элементы.Добавить();
				ОформлениеЦветФона = ЭлементУО.Оформление.Элементы.Найти("ЦветФона");   
				ОформлениеЦветФона.Значение = WebЦвета.Красный;
				ОформлениеЦветФона.Использование = Истина;
				//добавляем условие
				ЭлементУсловия 					= ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				//что сравниваем()                                                                                       	
				ЭлементУсловия.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Объект.ОтпускаСотрудников.Сотрудник");
				//как сравниваем
				ЭлементУсловия.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
				//с чем сравниваем
				ЭлементУсловия.ПравоеЗначение 	= Справочники.Пользователи.НайтиПоНаименованию(СотрудникСверка);	
				ЭлементУсловия.Использование	= Истина;
				//оформляемые поля
				ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
				ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудниковСотрудник"); 
				ЭлементУсловия.Использование		= Истина;
							
			КонецЦикла; 
		КонецЦикла;
	КонецЕсли;
	

КонецПроцедуры



&НаКлиенте
Процедура СформироватьГрафик(Команда)
	АдресПередаваемыхПараметров = ПоместитьЗначенияВХралищие();
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Адрес",АдресПередаваемыхПараметров);
	
	//@skip-check notify-description-to-server-procedure
	ОписаниеОповещение = Новый ОписаниеОповещения("ЗаполнитьРезультатОбработкиСервер", ЭтаФорма, СтруктураПараметров);
	
	Попытка
		ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика",СтруктураПараметров,ЭтаФорма,,,,ОписаниеОповещение); 
	Исключение
		ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.ФормаДокумента",СтруктураПараметров,ЭтаФорма,,,,ОписаниеОповещение);
	КонецПопытки; 

КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции


&НаСервере
Функция ПоместитьЗначенияВХралищие()
	
	Перем СтруктураПараметров;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Номер",Объект.номер);
	СтруктураПараметров.Вставить("Дата",Объект.Дата);	 
	СтруктураПараметров.Вставить("Год",Объект.Год);
	СтруктураПараметров.Вставить("Ссылка", Объект.Ссылка);
	СтруктураПараметров.Вставить("ДГ", ЭтаФорма.ДГ);
	
	СтруктураПараметров.Вставить("ТабличнаяЧасть",Объект.ОтпускаСотрудников.Выгрузить());
	
	Адрес = ПоместитьВоВременноеХранилище(СтруктураПараметров,Новый УникальныйИдентификатор);
	Возврат Адрес; 
	
КонецФункции 




&НаСервере
Процедура ЗаполнитьРезультатОбработкиСервер(РезультатЗакрытия,Параметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров = ПолучитьИзВременногоХранилища(РезультатЗакрытия.Адрес);
	Объект.Дата = СтруктураПараметров.Дата;
	Объект.Номер = СтруктураПараметров.Номер;
	Объект.Год = СтруктураПараметров.Год;
	ЭтаФорма.ДГ = СтруктураПараметров.Диаграмма;
	
	Объект.ОтпускаСотрудников.Загрузить(СтруктураПараметров.ТабличнаяЧасть);
	
КонецПроцедуры

#КонецОбласти

