
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
	СформироватьДвиженияДополнительныеНачисления();
	Движения.ВКМ_ДополнительныеНачисления.Записать(); 
	СформироватьДвиженияУдержания();
	Движения.ВКМ_Удержания.Записать(); 
	СформироватьДвиженияВзаиморасчетыСПерсоналом ();
		
КонецПроцедуры



#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвиженияДополнительныеНачисления()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_НачислениеФиксированнойПремииСписокСотрудников.Сотрудник КАК Сотрудник,
	               |	ЕСТЬNULL(ВКМ_НачислениеФиксированнойПремииСписокСотрудников.СуммаПремии, 0) КАК СуммаПремии
	               |ИЗ
	               |	Документ.ВКМ_НачислениеФиксированнойПремии.СписокСотрудников КАК ВКМ_НачислениеФиксированнойПремииСписокСотрудников
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВКМ_НачислениеФиксированнойПремии КАК ВКМ_НачислениеФиксированнойПремии
	               |		ПО ВКМ_НачислениеФиксированнойПремииСписокСотрудников.Ссылка = ВКМ_НачислениеФиксированнойПремии.Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
	Выборка = Запрос.Выполнить().Выбрать(); 
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Движение.ПериодРегистрации = Дата;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.Премия;;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.Сумма =  Выборка.СуммаПремии;		
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьДвиженияУдержания();  
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ДополнительныеНачисления.Сотрудник КАК Сотрудник,
	|	ЕСТЬNULL(ВКМ_ДополнительныеНачисления.Сумма, 0) * 13 / 100 КАК Сумма
	|ИЗ
	|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВКМ_НачислениеФиксированнойПремии КАК ВКМ_НачислениеФиксированнойПремии
	|		ПО ВКМ_ДополнительныеНачисления.Регистратор = ВКМ_НачислениеФиксированнойПремии.Ссылка
	|ГДЕ
	|	ВКМ_НачислениеФиксированнойПремии.Ссылка = &Ссылка";  
	
	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();   
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Движение = Движения.ВКМ_Удержания.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, ВыборкаДетальныеЗаписи);
		Движение.ПериодРегистрации = Дата;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.УдержанНДФЛ;
		Движение.Сумма =  ВыборкаДетальныеЗаписи.Сумма; 
		Движение.Сотрудник =  ВыборкаДетальныеЗаписи.Сотрудник;
	
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьДвиженияВзаиморасчетыСПерсоналом ()
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ДополнительныеНачисления.Сотрудник КАК Сотрудник,
		|	ВКМ_ДополнительныеНачисления.Сумма - ВКМ_Удержания.Сумма КАК СуммаКВыплате
		|ПОМЕСТИТЬ ВТ_начисления
		|ИЗ
		|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
		|		ПО ВКМ_ДополнительныеНачисления.Регистратор.Ссылка = ВКМ_Удержания.Регистратор.Ссылка
		|ГДЕ
		|	ВКМ_ДополнительныеНачисления.Регистратор.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_начисления.Сотрудник КАК Сотрудник,
		|	СУММА(ВТ_начисления.СуммаКВыплате) КАК СуммаКВыплате
		|ИЗ
		|	ВТ_начисления КАК ВТ_начисления
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_начисления.Сотрудник";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТЗ = РезультатЗапроса.Выгрузить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.Период = Дата;
		ЗаполнитьЗначенияСвойств(Движение, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
