
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//Начало кода для проверки типа договора и даты документа в периоде (ВКМ_диплом)
	
	НачПериод = ВКМ_Договор.ВКМ_НачПериод;
    КонПериод = ВКМ_Договор.ВКМ_КонПериод;
    Если ВКМ_Договор.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Выберите правильный договор, Абонентское обслуживание.";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли; 
	Если  НачПериод < Дата и  Дата > ВКМ_Договор.ВКМ_КонПериод  Тогда  
	    Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не правильная дата документа.";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли; 
		
	//Конец кода проверки типа договора и даты документа в периоде (ВКМ_диплом)
	
	//Начало кода  заполнения регистра накопления (ВКМ_диплом)  
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	
	СтоимостьЧаса = ПолучитьДанныеИзДоговора();
	
	Для Каждого ТекСтрокаВКМ_ВыполненныеРаботы из ВКМ_ВыполненныеРаботы Цикл
			
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.Период = Дата;
		Движение.ВКМ_Договор = ВКМ_Договор;
		Движение.ВКМ_Клиент = ВКМ_Клиент;	
		Движение.ВКМ_КоличествоЧасов = ТекСтрокаВКМ_ВыполненныеРаботы.ВКМ_ЧасыКОплатеКлиенту;	
		Движение.ВКМ_СуммаКОплате = ТекСтрокаВКМ_ВыполненныеРаботы.ВКМ_ЧасыКОплатеКлиенту * СтоимостьЧаса ; 


	КонецЦикла;	
	// Конец кода заполнения регистра накопления (ВКМ_диплом)

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	// Начало кода для проверки вновь созданного документа в базе 1с (ВКМ_диплом)
	Если ОбменДанными.Загрузка Тогда
     Возврат;
    КонецЕсли;
	Если ДополнительныеСвойства.Свойство("ЭтоНовыйОбъект", Истина) Тогда
		НовыйЭлемент = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
		НовыйЭлемент.ТекстСообщения = "Создано новое задание с номером " + ЭтотОбъект.Ссылка.Номер + " и датой " +
		ЭтотОбъект.Ссылка.Дата;
		НовыйЭлемент.Записать();
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = " Создано уведомление для телеграм-бота";
		Сообщение.Сообщить(); 		
    КонецЕсли;
		// Конец кода для проверки вновь созданного документа в базе 1с (ВКМ_диплом)	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// Начало кода для присваивания истиности нового документа (ВКМ_диплом)
	Если ОбменДанными.Загрузка Тогда
     Возврат;
    КонецЕсли;
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Ссылка) Тогда	
		ДополнительныеСвойства.Вставить("ЭтоНовыйОбъект", Истина);	
	КонецЕсли; 
	// Конец окда для присваивания истиности нового документа (ВКМ_диплом)
КонецПроцедуры
#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


Функция СформироватьДвиженияВыполненныеСотрудникуРаботы() 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_ПроцентОтРаботы, 0) КАК ПроцентОтРаботы,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Период КАК Период,
		|	НАЧАЛОПЕРИОДА(ВКМ_ОбслуживаниеКлиентов.Дата, МЕСЯЦ) КАК Дата
		|ИЗ
		|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВКМ_ОбслуживаниеКлиентов КАК ВКМ_ОбслуживаниеКлиентов
		|		ПО ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_Сотрудник.Ссылка = ВКМ_ОбслуживаниеКлиентов.ВКМ_Специалист
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиентов.Ссылка = &Ссылка
		|	И НАЧАЛОПЕРИОДА(ВКМ_ОбслуживаниеКлиентов.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ВКМ_ОбслуживаниеКлиентов.Дата, МЕСЯЦ)";   
	
	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);	
	РезультатЗапроса = Запрос.Выполнить();  
	ТЗ =  РезультатЗапроса.Выгрузить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
    Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина; 
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПроцентОтРаботы) или ВыборкаДетальныеЗаписи.ПроцентОтРаботы = 0 Тогда
			Для Каждого ТекСтрокаВКМ_ВыполненныеРаботы из ВКМ_ВыполненныеРаботы Цикл
						
				Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
				Движение.ВидДвижения  =  ВидДвиженияНакопления.Приход;
				Движение.Период = Дата;
				Движение.ВКМ_Сотрудник = ВКМ_Специалист; 
				
				Движение.ВКМ_ЧасовКОплате = ТекСтрокаВКМ_ВыполненныеРаботы.ВКМ_ЧасыКОплатеКлиенту; 
				СтоимостьЧаса = ПолучитьДанныеИзДоговора(); 
				ИтогоСтоимость = СтоимостьЧаса * ТекСтрокаВКМ_ВыполненныеРаботы.ВКМ_ЧасыКОплатеКлиенту;
				Движение.ВКМ_СуммаКОплате = (ИтогоСтоимость*
				ВыборкаДетальныеЗаписи.ПроцентОтРаботы/100);
			КонецЦикла;	
		ИначеЕсли ВыборкаДетальныеЗаписи.ПроцентОтРаботы = Неопределено
			ИЛИ  ВыборкаДетальныеЗаписи.ПроцентОтРаботы = " "  Тогда
			
			Отказ = Истина;
			Возврат Отказ;	
		КонецЕсли; 
	КонецЦикла;

КонецФункции 


Функция ПолучитьДанныеИзДоговора()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы КАК СтоимостьЧасаРаботы,
		|	ВКМ_ОбслуживаниеКлиентов.ВКМ_Договор.Ссылка КАК Договор
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиентов КАК ВКМ_ОбслуживаниеКлиентов
		|		ПОЛНОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ПО ВКМ_ОбслуживаниеКлиентов.ВКМ_Договор.Ссылка = ДоговорыКонтрагентов.Ссылка
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиентов.Ссылка = &Ссылка"; 
	
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Таблица = РезультатЗапроса.Выгрузить(); 
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтоимостьЧасаРаботы = ВыборкаДетальныеЗаписи.СтоимостьЧасаРаботы;
	КонецЦикла;
	
	Возврат СтоимостьЧасаРаботы;
	
КонецФункции


#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
