
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//Начало кода для проверки типа договора и даты документа в периоде (ВКМ_диплом)
	
	НачПериод = ВКМ_Договор.ВКМ_НачПериод;
    КонПериод = ВКМ_Договор.ВКМ_КонПериод;
    Если ВКМ_Договор.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Выберите правильный договор, Абонентское обслуживание.";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли; 
	Если  НачПериод < Дата и  Дата > ВКМ_Договор.ВКМ_КонПериод  Тогда  
	    Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не правильная дата документа.";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли; 
		
	//Конец кода проверки типа договора и даты документа в периоде (ВКМ_диплом)
	
	//Начало кода  заполнения регистра накопления (ВКМ_диплом)  
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	
	Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
	Движение.ВидДвижения  =  ВидДвиженияНакопления.Приход;
    Движение.Период = Дата;
	Движение.ВКМ_Договор = ВКМ_Договор;
	Движение.ВКМ_Клиент = ВКМ_Клиент;
	
	Для Каждого ТекСтрокаВКМ_ВыполненныеРаботы из ВКМ_ВыполненныеРаботы Цикл
		
		Движение.ВКМ_КоличествоЧасов = ТекСтрокаВКМ_ВыполненныеРаботы.ВКМ_ФактическиПотраченоЧасов;
		Движение.ВКМ_СуммаКОплате = ТекСтрокаВКМ_ВыполненныеРаботы.ВКМ_ЧасыКОплатеКлиенту;
	КонецЦикла;	
	// Конец кода заполнения регистра накопления (ВКМ_диплом)

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	// Начало кода для проверки вновь созданного документа в базе 1с (ВКМ_диплом)
	Если ОбменДанными.Загрузка Тогда
     Возврат;
    КонецЕсли;
	Если ДополнительныеСвойства.Свойство("ЭтоНовыйОбъект", Истина) Тогда
		НовыйЭлемент = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
		НовыйЭлемент.ТекстСообщения = "Создано новое задание с номером " + ЭтотОбъект.Ссылка.Номер + " и датой " +
		ЭтотОбъект.Ссылка.Дата;
		НовыйЭлемент.Записать();
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = " Создано уведомление для телеграм-бота";
		Сообщение.Сообщить(); 		
    КонецЕсли;
		// Конец кода для проверки вновь созданного документа в базе 1с (ВКМ_диплом)	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// Начало кода для присваивания истиности нового документа (ВКМ_диплом)
	Если ОбменДанными.Загрузка Тогда
     Возврат;
    КонецЕсли;
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Ссылка) Тогда	
		ДополнительныеСвойства.Вставить("ЭтоНовыйОбъект", Истина);	
	КонецЕсли; 
	// Конец окда для присваивания истиности нового документа (ВКМ_диплом)
КонецПроцедуры
#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
