
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес); 	
	Объект.Номер = СтруктураПараметров.Номер;
	Объект.Дата = СтруктураПараметров.Дата;
	Объект.Год = СтруктураПараметров.Год;
	ЭтаФорма.ДГ = СтруктураПараметров.ДГ;
    Ссылка = СтруктураПараметров.Ссылка; 
    СоздатьДиаграмму(СтруктураПараметров.ДГ, Ссылка);
		
	Объект.ОтпускаСотрудников.Загрузить(СтруктураПараметров.ТабличнаяЧасть);

КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ВыполнитьЗакрытие(Команда)
	АдресПередаваемыхПараметров = ПоместитьЗначенияВХралищие();

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Адрес",АдресПередаваемыхПараметров);
	
	Закрыть(СтруктураПараметров);

КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПоместитьЗначенияВХралищие()   // закрытие 
	
	Перем СтруктураПараметров;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Дата",Объект.Дата);
	СтруктураПараметров.Вставить("Номер",Объект.Номер);	 
	СтруктураПараметров.Вставить("Год",Объект.Год);
	СтруктураПараметров.Вставить("Диаграмма", ЭтаФорма.ДГ);
			
	СтруктураПараметров.Вставить("ТабличнаяЧасть",Объект.ОтпускаСотрудников.Выгрузить()); 
		
	Адрес = ПоместитьВоВременноеХранилище(СтруктураПараметров,Новый УникальныйИдентификатор);
	Возврат Адрес; 
	
КонецФункции

&НаСервереБезКонтекста
Процедура СоздатьДиаграмму(ДГ, Ссылка) 	
		
	ДГ.Обновление = Ложь;
	ДГ.Очистить();  
	
	Серия = ДГ.УстановитьСерию("Отпуска"); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник КАК Сотрудник,
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала КАК ДатаНачала,
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников
		|ГДЕ
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаНачала,
		|	ДатаОкончания";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		
		    ТочкаСотрудник = ДГ.Точки.Добавить();
			ТочкаСотрудник.Текст = ВыборкаДетальныеЗаписи.Сотрудник;  
			ЗначениеСотрудник = ДГ.ПолучитьЗначение(ТочкаСотрудник, Серия); 
			ИнтервалСотрудник = ЗначениеСотрудник.Добавить();
			ИнтервалСотрудник.Начало = ВыборкаДетальныеЗаписи.ДатаНачала;
	        ИнтервалСотрудник.Конец = КонецДня(ВыборкаДетальныеЗаписи.ДатаОкончания);    
	КонецЦикла;  
	
	 	  ДГ.Обновление = Истина; 
	 	
		
  КонецПроцедуры


#КонецОбласти
