
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс




#КонецОбласти

#Область ОбработчикиСобытий


Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	
	СтандартнаяОбработка = Ложь;  
	
	
	ТаблицаДанных = ПроверитьЗаполненностьГрафика(); 
	Если  Не ЗначениеЗаполнено(ТаблицаДанных) Тогда
		Сообщить("Не заполнен график работы");
		Отказ = Истина; 
		Возврат;
	КонецЕсли; 

	
	СформироватьДвиженияОсновныеНачисления();	
	Движения.ВКМ_ОсновныеНачисления.Записать();	
	РасчитатьОклад();
	СформироватьДвиженияУдержания();
	Движения.ВКМ_Удержания.Записать();
	СформироватьДвиженияВзаиморасчетыСПерсоналом ();  
	СформироватьСведенияПоДаннымОтпуска();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвиженияОсновныеНачисления() 
		
	Если Начисления.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МинимальнаяДатаНачала = Неопределено;
	МаксимальнаяДатаОкончания = Неопределено;
	
	Для Каждого Строка Из Начисления Цикл
			
		Если Не ЗначениеЗаполнено(МинимальнаяДатаНачала)
			Или МинимальнаяДатаНачала > Строка.ДатаНачала Тогда
			МинимальнаяДатаНачала = Строка.ДатаНачала;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(МаксимальнаяДатаОкончания)
			Или МаксимальнаяДатаОкончания < Строка.ДатаОкончания Тогда
			МаксимальнаяДатаОкончания = Строка.ДатаОкончания;
		КонецЕсли;	
			
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_НачислениеЗарплатыНачисления.Сотрудник КАК Сотрудник,
	               |	ВКМ_НачислениеЗарплатыНачисления.ВидРасчета КАК ВидРасчета,
	               |	ВКМ_НачислениеЗарплатыНачисления.ДатаНачала КАК ДатаНачала,
	               |	ВКМ_НачислениеЗарплатыНачисления.ДатаОкончания КАК ДатаОкончания,
	               |	ВКМ_НачислениеЗарплатыНачисления.ГрафикРаботы КАК ГрафикРаботы
	               |ПОМЕСТИТЬ ВТ_ДанныеДокумента
	               |ИЗ
	               |	Документ.ВКМ_НачислениеЗарплаты.Начисления КАК ВКМ_НачислениеЗарплатыНачисления
	               |ГДЕ
	               |	ВКМ_НачислениеЗарплатыНачисления.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Период КАК Период,
	               |	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_Сотрудник КАК Сотрудник,
	               |	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_Оклад КАК Оклад
	               |ПОМЕСТИТЬ ВТ_ИсторияОклада
	               |ИЗ
	               |	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(
	               |			&МинимальнаяДатаНачала,
	               |			ВКМ_Сотрудник В
	               |				(ВЫБРАТЬ
	               |					ВТ_ДанныеДокумента.Сотрудник КАК Сотрудник
	               |				ИЗ
	               |					ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента)) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВКМ_УсловияОплатыСотрудников.Период,
	               |	ВКМ_УсловияОплатыСотрудников.ВКМ_Сотрудник,
	               |	ВКМ_УсловияОплатыСотрудников.ВКМ_Оклад
	               |ИЗ
	               |	РегистрСведений.ВКМ_УсловияОплатыСотрудников КАК ВКМ_УсловияОплатыСотрудников
	               |ГДЕ
	               |	ВКМ_УсловияОплатыСотрудников.Период > &МинимальнаяДатаНачала
	               |	И ВКМ_УсловияОплатыСотрудников.Период < &МаксимальнаяДатаОкончания
	               |	И ВКМ_УсловияОплатыСотрудников.ВКМ_Сотрудник В
	               |			(ВЫБРАТЬ
	               |				ВТ_ДанныеДокумента.Сотрудник КАК Сотрудник
	               |			ИЗ
	               |				ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТекущаяЗапись.Период КАК ДатаНачала,
	               |	ТекущаяЗапись.Сотрудник КАК Сотрудник,
	               |	ЕСТЬNULL(ДОБАВИТЬКДАТЕ(МИНИМУМ(СледующаяЗапись.Период), ДЕНЬ, -1), ДАТАВРЕМЯ(3999, 12, 21)) КАК ДатаОкончания
	               |ПОМЕСТИТЬ ВТ_Интервалы
	               |ИЗ
	               |	ВТ_ИсторияОклада КАК ТекущаяЗапись
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсторияОклада КАК СледующаяЗапись
	               |		ПО ТекущаяЗапись.Период = СледующаяЗапись.Период
	               |			И ТекущаяЗапись.Сотрудник = СледующаяЗапись.Сотрудник
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТекущаяЗапись.Период,
	               |	ТекущаяЗапись.Сотрудник
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Интервалы.ДатаНачала КАК ДатаНачала,
	               |	ВТ_Интервалы.Сотрудник КАК Сотрудник,
	               |	ВТ_Интервалы.ДатаОкончания КАК ДатаОкончания,
	               |	ВТ_ИсторияОклада.Оклад КАК Оклад
	               |ПОМЕСТИТЬ ВТ_ИнтервалыОклада
	               |ИЗ
	               |	ВТ_Интервалы КАК ВТ_Интервалы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ИсторияОклада КАК ВТ_ИсторияОклада
	               |		ПО ВТ_Интервалы.Сотрудник = ВТ_ИсторияОклада.Сотрудник
	               |			И ВТ_Интервалы.ДатаНачала = ВТ_ИсторияОклада.Период
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДанныеДокумента.Сотрудник КАК Сотрудник,
	               |	ВТ_ДанныеДокумента.ВидРасчета КАК ВидРасчета,
	               |	ВТ_ДанныеДокумента.ДатаНачала КАК ПериодДействияНачало,
	               |	ВТ_ДанныеДокумента.ДатаОкончания КАК ПериодДействияКонец,
	               |	ВТ_ИнтервалыОклада.Оклад КАК Показатель,
	               |	ВТ_ДанныеДокумента.ГрафикРаботы КАК ГрафикРаботы
	               |ПОМЕСТИТЬ ВТ_Итого
	               |ИЗ
	               |	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИнтервалыОклада КАК ВТ_ИнтервалыОклада
	               |		ПО ВТ_ДанныеДокумента.Сотрудник = ВТ_ИнтервалыОклада.Сотрудник
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Итого.Сотрудник КАК Сотрудник,
	               |	ВТ_Итого.ВидРасчета КАК ВидРасчета,
	               |	ВТ_Итого.Показатель КАК Показатель,
	               |	ВКМ_УсловияОплатыСотрудниковСрезПервых.ВКМ_ПроцентОтработы КАК ПроцентОтработы,
	               |	ВТ_Итого.ПериодДействияНачало КАК ПериодДействияНачало,
	               |	ВТ_Итого.ПериодДействияКонец КАК ПериодДействияКонец,
	               |	ВТ_Итого.ГрафикРаботы КАК ГрафикРаботы
	               |ИЗ
	               |	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПервых КАК ВКМ_УсловияОплатыСотрудниковСрезПервых
	               |		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Итого КАК ВТ_Итого
	               |		ПО ВКМ_УсловияОплатыСотрудниковСрезПервых.ВКМ_Сотрудник.Ссылка = ВТ_Итого.Сотрудник.Ссылка
	               |ГДЕ
	               |	ВКМ_УсловияОплатыСотрудниковСрезПервых.Период <= ВТ_Итого.ПериодДействияКонец";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("МинимальнаяДатаНачала", МинимальнаяДатаНачала);
	Запрос.УстановитьПараметр("МаксимальнаяДатаОкончания", МаксимальнаяДатаОкончания);
	
	Выборка = Запрос.Выполнить().Выбрать();  
	ТЗ = Запрос.Выполнить().Выгрузить(); 

	Пока Выборка.Следующий() Цикл 
		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
		Движение.ПериодРегистрации = Дата;
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
		Если Выборка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск Тогда
			Движение.БазовыйПериодНачало = НачалоМесяца(ДобавитьМесяц(Выборка.ПериодДействияНачало, -3));
			Движение.БазовыйПериодКонец = КонецМесяца(ДобавитьМесяц(Выборка.ПериодДействияКонец, -1)); 
			Движение.Показатель = "";
			Движение.ПроцентОтРаботы ="";
		КонецЕсли;  
	КонецЦикла; 
	
			Для каждого стр из Движения.ВКМ_ОсновныеНачисления цикл
			Если  Движение.ВидРасчета <> ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск  или  Выборка.ВидРасчета <> ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад  Тогда	
				Движение.Сумма = Стр.ПроцентОтРаботы * Стр.Сумма/100;		
			КонецЕсли;
			Движения.Записать();
		КонецЦикла; 
		
	
	
	СформироватьСторноЗаписи ();  

		
КонецПроцедуры 

Процедура СформироватьСторноЗаписи ()
	
	//метод получить дополнения возвращает Таблицу значений, в которой содержится данные за прошлый период которые надо отсторнировать
	СторноЗаписи = Движения.ВКМ_ОсновныеНачисления.ПолучитьДополнение();
	
	Для каждого Строка из СторноЗаписи Цикл
		
		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Строка);
		
		Движение.ПериодРегистрации = Дата;
		Движение.ПериодДействияНачало = Строка.ПериодДействияНачалоСторно; //устанавливаем новую дату
		Движение.ПериодДействияКонец = Строка.ПериодДействияКонецСторно;
		Движение.Сторно = Истина;
		
	КонецЦикла;  
	
	//Движения.ВКМ_ОсновныеНачисления.Записать(, Истина);
	
	
КонецПроцедуры


Процедура РасчитатьОклад()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
	               |	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеПериодДействия, 0) КАК План,
	               |	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия, 0) КАК Факт
	               |ИЗ
	               |	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(
	               |			ВидРасчета <> ЗНАЧЕНИЕ(ПланВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск)
	               |				И Регистратор = &Ссылка) КАК ВКМ_ОсновныеНачисленияДанныеГрафика";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	ТЗ = Запрос.Выполнить().Выгрузить();
	Пока Выборка.Следующий() Цикл 
		
		Движение = Движения.ВКМ_ОсновныеНачисления[Выборка.НомерСтроки - 1]; 
		Если Выборка.План = 0 Тогда
			Сообщить ("Не заполнен график работы");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		Если Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад Тогда
			Движение.Сумма = Движение.Показатель * Выборка.Факт / Выборка.План;
			Движение.ПроцентОтРаботы = "";
		ИначеЕсли Движение.ВидРасчета<> ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад  или  Движение.ВидРасчета<> ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск Тогда
			Движение.Сумма = (Движение.Показатель * Выборка.Факт / Выборка.План)* Движение.ПроцентОтРаботы/100;
		КонецЕсли;
	 

		Движение.ЧасовОтработано = Выборка.Факт;
		
		Если Движение.Сторно Тогда
			Движение.Сумма = - Движение.Сумма;
			Движение.ЧасовОтработано = - Движение.ЧасовОтработано;
		КонецЕсли;
		
	КонецЦикла;
	
	Движения.ВКМ_ОсновныеНачисления.Записать(, Истина);
	
	
КонецПроцедуры


Процедура СформироватьДвиженияУдержания();  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник,
	|	ЕСТЬNULL(ВКМ_ОсновныеНачисления.Сумма, 0) * 13 / 100 КАК Сумма,
	|	ВКМ_ОсновныеНачисления.ВидРасчета КАК ВидРасчета,
	|	ВКМ_НачислениеЗарплаты.Ссылка КАК Ссылка,
	|	ВКМ_ОсновныеНачисления.Регистратор.Ссылка КАК РегистраторСсылка
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВКМ_НачислениеЗарплаты КАК ВКМ_НачислениеЗарплаты
	|		ПО ВКМ_ОсновныеНачисления.Регистратор = ВКМ_НачислениеЗарплаты.Ссылка
	|ГДЕ
	|	ВКМ_НачислениеЗарплаты.Ссылка = &Ссылка"; 
	
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();   
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Движение = Движения.ВКМ_Удержания.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, ВыборкаДетальныеЗаписи);
		Движение.ПериодРегистрации = Дата;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.УдержанНДФЛ;
		Движение.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьДвиженияВзаиморасчетыСПерсоналом ()
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник,
	|	СУММА(ЕСТЬNULL(ВКМ_ОсновныеНачисления.Сумма, 0)) КАК Сумма1
	|ПОМЕСТИТЬ ВТ_Начисления
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
	|ГДЕ
	|	ВКМ_ОсновныеНачисления.Регистратор.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ОсновныеНачисления.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ЕСТЬNULL(ВКМ_Удержания.Сумма, 0)) КАК Сумма,
	|	ВКМ_Удержания.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВТ_Удержания
	|ИЗ
	|	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
	|ГДЕ
	|	ВКМ_Удержания.Регистратор = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_Удержания.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Начисления.Сотрудник КАК Сотрудник,
	|	ВТ_Начисления.Сумма1 - ВТ_Удержания.Сумма КАК СуммаКВыплате
	|ИЗ
	|	ВТ_Начисления КАК ВТ_Начисления
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Удержания КАК ВТ_Удержания
	|		ПО ВТ_Начисления.Сотрудник.Ссылка = ВТ_Удержания.Сотрудник.Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
	ТЗ = РезультатЗапроса.Выгрузить();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.Период = Дата;
		ЗаполнитьЗначенияСвойств(Движение, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
	
КонецПроцедуры

Процедура СформироватьСведенияПоДаннымОтпуска ()
	
	Движения.ВКМ_ГрафикиОтпусковФакт.Записывать = Истина;
	Для Каждого ТекСтрокаНачисления Из Начисления Цикл 
		Если  ТекСтрокаНачисления.ВидРасчета =  ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск	Тогда	
			Движение = Движения.ВКМ_ГрафикиОтпусковФакт.Добавить();
			Движение.Сотрудник = ТекСтрокаНачисления.Сотрудник;
			Движение.НачалоОтпускаФакт = ТекСтрокаНачисления.ДатаНачала;
			Движение.ОкончаниеОтпускаФакт =  ТекСтрокаНачисления.ДатаОкончания;
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры

Функция ПроверитьЗаполненностьГрафика() экспорт

		Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ГрафикиРаботы.Дата КАК Дата,
		|	ВКМ_НачислениеЗарплатыНачисления.ДатаНачала КАК ДатаНачала,
		|	ВКМ_НачислениеЗарплатыНачисления.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	РегистрСведений.ВКМ_ГрафикиРаботы КАК ВКМ_ГрафикиРаботы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВКМ_НачислениеЗарплаты.Начисления КАК ВКМ_НачислениеЗарплатыНачисления
		|		ПО ВКМ_ГрафикиРаботы.Дата >= ВКМ_НачислениеЗарплатыНачисления.ДатаНачала
		|			И ВКМ_ГрафикиРаботы.Дата <= ВКМ_НачислениеЗарплатыНачисления.ДатаОкончания
		|ГДЕ
		|	ВКМ_НачислениеЗарплатыНачисления.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаДанных = РезультатЗапроса.Выгрузить();
	
		
  Возврат ТаблицаДанных;
  
КонецФункции

Функция ПолучитьПроцентаОтРаботы(Движения)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_Сотрудник КАК ВКМ_Сотрудник,
		|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_ПроцентОтработы, 0) КАК ПроцентОтРаботы,
		|	ВКМ_НачислениеЗарплатыНачисления.ВидРасчета КАК ВидРасчета
		|ИЗ
		|	Документ.ВКМ_НачислениеЗарплаты.Начисления КАК ВКМ_НачислениеЗарплатыНачисления
		|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
		|		ПО ВКМ_НачислениеЗарплатыНачисления.Сотрудник.Ссылка = ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_Сотрудник.Ссылка
		|ГДЕ
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Период <= ВКМ_НачислениеЗарплатыНачисления.ДатаОкончания
		|	И ВКМ_НачислениеЗарплатыНачисления.ВидРасчета.Ссылка <> &ВидРасчета
		|	И ВКМ_НачислениеЗарплатыНачисления.ВидРасчета.Ссылка <> &ВидРасчета2
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_Сотрудник,
		|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_ПроцентОтработы, 0),
		|	ВКМ_НачислениеЗарплатыНачисления.ВидРасчета"; 
	
    Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);
	Запрос.УстановитьПараметр("ВидРасчета2", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск);

	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
	
    Возврат ВыборкаДетальныеЗаписи;
	
КонецФункции


#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
