
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс




#КонецОбласти

#Область ОбработчикиСобытий


Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	
	СформироватьДвиженияОсновныеНачисления();	
	Движения.ВКМ_ОсновныеНачисления.Записать();	
	РасчитатьОклад();
	СформироватьДвиженияУдержания();
	Движения.ВКМ_Удержания.Записать();
	СформироватьДвиженияВзаиморасчетыСПерсоналом ();  
	СформироватьСведенияПоДаннымОтпуска();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвиженияОсновныеНачисления()
	
	Если Начисления.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МинимальнаяДатаНачала = Неопределено;
	МаксимальнаяДатаОкончания = Неопределено;
	
	Для Каждого Строка Из Начисления Цикл
		
		//Если Строка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад Тогда
		Если Не ЗначениеЗаполнено(МинимальнаяДатаНачала)
			Или МинимальнаяДатаНачала > Строка.ДатаНачала Тогда
			МинимальнаяДатаНачала = Строка.ДатаНачала;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(МаксимальнаяДатаОкончания)
			Или МаксимальнаяДатаОкончания < Строка.ДатаОкончания Тогда
			МаксимальнаяДатаОкончания = Строка.ДатаОкончания;
		КонецЕсли;	
		
		//КонецЕсли;    
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_НачислениеЗарплатыНачисления.Сотрудник КАК Сотрудник,
	|	ВКМ_НачислениеЗарплатыНачисления.ВидРасчета КАК ВидРасчета,
	|	ВКМ_НачислениеЗарплатыНачисления.ДатаНачала КАК ДатаНачала,
	|	ВКМ_НачислениеЗарплатыНачисления.ДатаОкончания КАК ДатаОкончания,
	|	ВКМ_НачислениеЗарплатыНачисления.ГрафикРаботы КАК ГрафикРаботы
	|ПОМЕСТИТЬ ВТ_ДанныеДокумента
	|ИЗ
	|	Документ.ВКМ_НачислениеЗарплаты.Начисления КАК ВКМ_НачислениеЗарплатыНачисления
	|ГДЕ
	|	ВКМ_НачислениеЗарплатыНачисления.Ссылка = &Ссылка
	|	И ВКМ_НачислениеЗарплатыНачисления.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.ВКМ_ОсновныеНачисления.Оклад))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Период КАК Период,
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_Сотрудник КАК Сотрудник,
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_Оклад КАК Оклад
	|ПОМЕСТИТЬ ВТ_ИсторияОклада
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(
	|			&МинимальнаяДатаНачала,
	|			ВКМ_Сотрудник В
	|				(ВЫБРАТЬ
	|					ВТ_ДанныеДокумента.Сотрудник КАК Сотрудник
	|				ИЗ
	|					ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента)) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВКМ_УсловияОплатыСотрудников.Период,
	|	ВКМ_УсловияОплатыСотрудников.ВКМ_Сотрудник,
	|	ВКМ_УсловияОплатыСотрудников.ВКМ_Оклад
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников КАК ВКМ_УсловияОплатыСотрудников
	|ГДЕ
	|	ВКМ_УсловияОплатыСотрудников.Период > &МинимальнаяДатаНачала
	|	И ВКМ_УсловияОплатыСотрудников.Период < &МаксимальнаяДатаОкончания
	|	И ВКМ_УсловияОплатыСотрудников.ВКМ_Сотрудник В
	|			(ВЫБРАТЬ
	|				ВТ_ДанныеДокумента.Сотрудник КАК Сотрудник
	|			ИЗ
	|				ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТекущаяЗапись.Период КАК ДатаНачала,
	|	ТекущаяЗапись.Сотрудник КАК Сотрудник,
	|	ЕСТЬNULL(ДОБАВИТЬКДАТЕ(МИНИМУМ(СледующаяЗапись.Период), ДЕНЬ, -1), ДАТАВРЕМЯ(3999, 12, 21)) КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТ_Интервалы
	|ИЗ
	|	ВТ_ИсторияОклада КАК ТекущаяЗапись
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсторияОклада КАК СледующаяЗапись
	|		ПО ТекущаяЗапись.Период = СледующаяЗапись.Период
	|			И ТекущаяЗапись.Сотрудник = СледующаяЗапись.Сотрудник
	|
	|СГРУППИРОВАТЬ ПО
	|	ТекущаяЗапись.Период,
	|	ТекущаяЗапись.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Интервалы.ДатаНачала КАК ДатаНачала,
	|	ВТ_Интервалы.Сотрудник КАК Сотрудник,
	|	ВТ_Интервалы.ДатаОкончания КАК ДатаОкончания,
	|	ВТ_ИсторияОклада.Оклад КАК Оклад
	|ПОМЕСТИТЬ ВТ_ИнтервалыОклада
	|ИЗ
	|	ВТ_Интервалы КАК ВТ_Интервалы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ИсторияОклада КАК ВТ_ИсторияОклада
	|		ПО ВТ_Интервалы.Сотрудник = ВТ_ИсторияОклада.Сотрудник
	|			И ВТ_Интервалы.ДатаНачала = ВТ_ИсторияОклада.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеДокумента.Сотрудник КАК Сотрудник,
	|	ВТ_ДанныеДокумента.ВидРасчета КАК ВидРасчета,
	|	ВТ_ДанныеДокумента.ДатаНачала КАК ПериодДействияНачало,
	|	ВТ_ДанныеДокумента.ДатаОкончания КАК ПериодДействияКонец,
	|	ВТ_ИнтервалыОклада.Оклад КАК Показатель,
	|	ВТ_ДанныеДокумента.ГрафикРаботы КАК ГрафикРаботы
	|ИЗ
	|	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИнтервалыОклада КАК ВТ_ИнтервалыОклада
	|		ПО ВТ_ДанныеДокумента.Сотрудник = ВТ_ИнтервалыОклада.Сотрудник";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("МинимальнаяДатаНачала", МинимальнаяДатаНачала);
	Запрос.УстановитьПараметр("МаксимальнаяДатаОкончания", МаксимальнаяДатаОкончания);
	
	Выборка = Запрос.Выполнить().Выбрать();  
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
		Движение.ПериодРегистрации = Дата;
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
	
	КонецЦикла;   
		
КонецПроцедуры 

Процедура РасчитатьОклад()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
	|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеПериодДействия, 0) КАК План,
	|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия, 0) КАК Факт
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(
	|			ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ВКМ_ОсновныеНачисления.Оклад)
	|				И Регистратор = &Ссылка) КАК ВКМ_ОсновныеНачисленияДанныеГрафика";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		Движение = Движения.ВКМ_ОсновныеНачисления[Выборка.НомерСтроки - 1];
		Движение.Сумма = Движение.Показатель * Выборка.Факт / Выборка.План;
		Движение.ЧасовОтработано = Выборка.Факт;
		
		Если Движение.Сторно Тогда
			Движение.Сумма = - Движение.Сумма;
			Движение.ЧасовОтработано = - Движение.ЧасовОтработано;
		КонецЕсли;
		
	КонецЦикла;
	
	Движения.ВКМ_ОсновныеНачисления.Записать(, Истина);
	
	
КонецПроцедуры


Процедура СформироватьДвиженияУдержания();  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник,
	|	ЕСТЬNULL(ВКМ_ОсновныеНачисления.Сумма, 0) * 13 / 100 КАК Сумма,
	|	ВКМ_ОсновныеНачисления.ВидРасчета КАК ВидРасчета,
	|	ВКМ_НачислениеЗарплаты.Ссылка КАК Ссылка,
	|	ВКМ_ОсновныеНачисления.Регистратор.Ссылка КАК РегистраторСсылка
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВКМ_НачислениеЗарплаты КАК ВКМ_НачислениеЗарплаты
	|		ПО ВКМ_ОсновныеНачисления.Регистратор = ВКМ_НачислениеЗарплаты.Ссылка
	|ГДЕ
	|	ВКМ_НачислениеЗарплаты.Ссылка = &Ссылка"; 
	
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();   
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Движение = Движения.ВКМ_Удержания.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, ВыборкаДетальныеЗаписи);
		Движение.ПериодРегистрации = Дата;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.УдержанНДФЛ;
		Движение.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьДвиженияВзаиморасчетыСПерсоналом ()
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник,
	|	ВКМ_ОсновныеНачисления.Сумма - ВКМ_Удержания.Сумма КАК СуммаКВыплате
	|ПОМЕСТИТЬ ВТ_начисления
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
	|		ПО ВКМ_ОсновныеНачисления.Сотрудник = ВКМ_Удержания.Сотрудник
	|ГДЕ
	|	ВКМ_ОсновныеНачисления.Регистратор.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_начисления.Сотрудник КАК Сотрудник,
	|	ВТ_начисления.СуммаКВыплате КАК СуммаКВыплате
	|ИЗ
	|	ВТ_начисления КАК ВТ_начисления
	|СГРУППИРОВАТЬ ПО
	|	ВТ_начисления.Сотрудник,
	|	ВТ_начисления.СуммаКВыплате";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.Период = Дата;
		ЗаполнитьЗначенияСвойств(Движение, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
	
КонецПроцедуры

Процедура СформироватьСведенияПоДаннымОтпуска ()
	
	Движения.ВКМ_ГрафикиОтпусковФакт.Записывать = Истина;
	Для Каждого ТекСтрокаНачисления Из Начисления Цикл 
		Если ТекСтрокаНачисления.ВидРасчета <>  ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад	Тогда	
			Движение = Движения.ВКМ_ГрафикиОтпусковФакт.Добавить();
			Движение.Сотрудник = ТекСтрокаНачисления.Сотрудник;
			Движение.НачалоОтпускаФакт = ТекСтрокаНачисления.ДатаНачала;
			Движение.ОкончаниеОтпускаФакт =  ТекСтрокаНачисления.ДатаОкончания;
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры


#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
