
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
//Начало добавление реквизитов программно на форме документа (ВКМ_диплом)
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	    ГруппаПоВертикали = Элементы.Добавить("ГруппаПоВертикали",Тип("ГруппаФормы"),);
		ГруппаПоВертикали.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаПоВертикали.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		ГруппаПоВертикали.Заголовок = "Группировка по горизонтали";
		ГруппаПоВертикали.ОтображатьЗаголовок = Ложь;
		
		ВКМ_НачПериод = ЭтотОбъект.Элементы.Добавить ("ВКМ_НачПериод", Тип("ПолеФормы"),ГруппаПоВертикали);  
		ВКМ_НачПериод.Вид = ВидПоляФормы.ПолеВвода; 
		ВКМ_НачПериод.ПутьКДанным = "Объект.ВКМ_НачПериод"; 
		ВКМ_НачПериод.Заголовок = "С";  
		ВКМ_НачПериод.Видимость = Ложь;
		ВКМ_КонПериод = ЭтотОбъект.Элементы.Добавить("ВКМ_КонПериод", Тип("ПолеФормы"),ГруппаПоВертикали); 
		ВКМ_КонПериод.Вид = ВидПоляФормы.ПолеВВода; 
		ВКМ_КонПериод.ПутьКДанным = "Объект.ВКМ_КонПериод";
		ВКМ_КонПериод.Заголовок = "По";
		ВКМ_КонПериод.Видимость = Ложь; 
		АвтоМаксимальнаяШирина = Ложь;
		МаксимальнаяШирина = 1;
		
		ВКМ_СуммаАбонентскойПлаты = ЭтотОбъект.Элементы.Добавить("ВКМ_СуммаАбонентскойПлаты", Тип("ПолеФормы"));
		ВКМ_СуммаАбонентскойПлаты.Вид = ВидПоляФормы.ПолеВвода;  	
		ВКМ_СуммаАбонентскойПлаты.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
		ВКМ_СуммаАбонентскойПлаты.Заголовок = "Сумма абонентской платы";
		ВКМ_СуммаАбонентскойПлаты.Видимость = Ложь;
		
		ВКМ_СтоимостьЧасаРаботы = ЭтотОбъект.Элементы.Добавить("ВКМ_СтоимостьЧасаРаботы", Тип("ПолеФормы"));
		ВКМ_СтоимостьЧасаРаботы.Вид = ВидПоляФормы.ПолеВвода;  	
		ВКМ_СтоимостьЧасаРаботы.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
		ВКМ_СтоимостьЧасаРаботы.Заголовок = "Стоимость часа работы";
		ВКМ_СтоимостьЧасаРаботы.Видимость = Ложь;  
	
КонецПроцедуры
// Конец кода добавления реквизитов на форму документа (ВКМ_диплом)
#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВидДоговораПриИзмененииНаСервере();
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Начало кода для выбора условия при выборе вида договора (ВКМ_диплом)
&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере()
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		Элементы.ВКМ_НачПериод.Видимость = Истина;
		Элементы.ВКМ_КонПериод.Видимость = Истина;
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Истина;
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Истина;
	Иначе
		Элементы.ВКМ_НачПериод.Видимость = Ложь;
		Элементы.ВКМ_КонПериод.Видимость = Ложь;;
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Ложь;
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Ложь;

	КонецЕсли;
	
КонецПроцедуры
// Конецкода для выбора условия при выборе вида договора (ВКМ_диплом)
#КонецОбласти

