
#Область ПрограммныйИнтерфейс

Функция  СозданиеРеализаций (Период) экспорт  
	
	НачПериод = Период.ДатаНачала;
	КонПериод = Период.ДатаОкончания;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Договор,
		|	РеализацияТоваровУслуг.Ссылка КАК Реализация,
		|	ДоговорыКонтрагентов.Организация КАК Организация,
		|	ДоговорыКонтрагентов.Владелец КАК Контрагент,
		|	ВКМ_ВыполненныеКлиентуРаботы.Период КАК Период
		|ПОМЕСТИТЬ ВТ_Договора
		|ИЗ
		|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы КАК ВКМ_ВыполненныеКлиентуРаботы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|			ПО ДоговорыКонтрагентов.Ссылка = РеализацияТоваровУслуг.Договор.Ссылка
		|		ПО ВКМ_ВыполненныеКлиентуРаботы.ВКМ_Договор = ДоговорыКонтрагентов.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ДоговорыКонтрагентов.Организация,
		|	ДоговорыКонтрагентов.Владелец,
		|	ДоговорыКонтрагентов.Ссылка,
		|	РеализацияТоваровУслуг.Ссылка,
		|	ВКМ_ВыполненныеКлиентуРаботы.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Договора.Договор.ВидДоговора КАК ДоговорВидДоговора,
		|	ВТ_Договора.Договор КАК Договор,
		|	ЕСТЬNULL(ВТ_Договора.Реализация.Ссылка, ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)) КАК Реализация,
		|	ВТ_Договора.Контрагент КАК Контрагент,
		|	ВТ_Договора.Организация КАК Организация
		|ИЗ
		|	ВТ_Договора КАК ВТ_Договора
		|ГДЕ
		|	ВТ_Договора.Договор.ВидДоговора.Ссылка = &ВидДоговора
		|	И ВТ_Договора.Договор.ВКМ_НачПериод <= &НачалоПериода
		|	И ВТ_Договора.Период МЕЖДУ &НачалоПериода И &КонецПериода";
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	Запрос.УстановитьПараметр("КонецПериода", КонПериод);
	Запрос.УстановитьПараметр("НачалоПериода", НачПериод);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(); 
	
	ТаблицаЗначений = РезультатЗапроса.Выгрузить();
	
	ОбработанныеДокументы = Новый Массив;
	
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено (Выборка.Реализация) Тогда 
			ТекущийДокумент = Выборка.Реализация.ПолучитьОбъект(); 
		Иначе
			ТекущийДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			ТекущийДокумент.Дата = КонПериод;	
		КонецЕсли; 
		
		ТекущийДокумент.Контрагент = Выборка.Контрагент;
		ТекущийДокумент.Договор = Выборка.Договор;
		ТекущийДокумент.Организация = Выборка.Организация; 
		ТекущийДокумент.Записать(РежимЗаписиДокумента.Запись);
		ТекущийДокумент.ВыполнитьАвтозаполнение();
		ТекущийДокумент.Записать(РежимЗаписиДокумента.Проведение);
		
		ОбработанныеДокументы.Добавить(Новый Структура("Договор,Реализация", Выборка.Договор, ТекущийДокумент.Ссылка));
		КонецЦикла;
	
	Возврат ОбработанныеДокументы;   
	
КонецФункции



#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции





#КонецОбласти
