
#Область ПрограммныйИнтерфейс

Функция СозданиеРеализаций(ДанныеСтруктуры, МассивДанных) Экспорт
    
    ЕстьРеализации = ПроверитьРеализациюНаПериод(МассивДанных[0].Период);

    Если ЕстьРеализации Тогда
        Сообщить("Уже созданы реализации за этот период"); 
       Возврат ложь;  
    КонецЕсли; 
    
    Если МассивДанных[1].Количество() > 0 Тогда
 
        Для Каждого Строка Из МассивДанных[1] Цикл

            НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		    НовыйДокумент.Дата = МассивДанных[0].Период.ДатаОкончания; 
			Контрагент = Строка.Контрагент.Ссылка.ПолучитьОбъект();
			Договор = Строка.Договор.Ссылка.ПолучитьОбъект();
			Организация = Строка.Организация.Ссылка.ПолучитьОбъект();
			НовыйДокумент.Контрагент = Контрагент.Ссылка;
			НовыйДокумент.Договор = Договор.Ссылка;
			НовыйДокумент.Организация = Организация.Ссылка; 
			НовыйДокумент.Основание = Документы.ЗаказПокупателя.НайтиПоНомеру("000000001");// в условиях задачи ничего не сказано, как заполнять это поле 
			НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
			
				    
			ЗаполнитьЗначенияСвойств(НовыйДокумент,Справочники.ДоговорыКонтрагентов.Выбрать(Строка.Договор.Ссылка)); 
			
		    
		    НовыйДокумент.ВыполнитьАвтозаполнение();
			НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
				
		    НовыйДокумент.СуммаДокумента = НовыйДокумент.Товары.Итог("Сумма") + НовыйДокумент.Услуги.Итог("Сумма");
		 		            
				Если НЕ НовыйДокумент.ПроверитьЗаполнение() Тогда
				   Возврат ложь;
				КонецЕсли;

		    НовыйДокумент.Записать();

		КонецЦикла; 
	КонецЕсли;


КонецФункции   


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПроверитьРеализациюНаПериод(Период)
	
	НачПериод = Период.ДатаНачала;
	КонПериод = Период.ДатаОкончания;
        
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |	РеализацияТоваровУслуг.Ссылка КАК Ссылка
        |ИЗ
        |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
        |		ПО РеализацияТоваровУслуг.Договор.Ссылка = ДоговорыКонтрагентов.Ссылка
        |ГДЕ
        |	НЕ РеализацияТоваровУслуг.ПометкаУдаления
        |	И РеализацияТоваровУслуг.Дата <= &КонПериода
        |	И РеализацияТоваровУслуг.Дата >= &НачПериода
        |	И ВЫБОР
        |			КОГДА РеализацияТоваровУслуг.Договор.Ссылка = ДоговорыКонтрагентов.Ссылка
        |				ТОГДА РеализацияТоваровУслуг.Ссылка = "" ""
        |		КОНЕЦ";
    
    Запрос.УстановитьПараметр("КонПериода", КонПериод); 
    Запрос.УстановитьПараметр("НачПериода", НачПериод);
    
    РезультатЗапроса = Запрос.Выполнить();
    
    Выборка = РезультатЗапроса.Выбрать(); 
	ТЗ = РезультатЗапроса.Выгрузить();
    
	Если Выборка.Следующий() Тогда 
		Возврат Истина; 
    Иначе 
        Возврат Ложь; 
	КонецЕсли;
        
КонецФункции 
#КонецОбласти
