
#Область ПрограммныйИнтерфейс

Функция СозданиеРеализаций(Период, МассивДанных,ПараметрыЗапуска) Экспорт
    
   МассивВозврат = Новый Массив; 
	
    ТаблицаЗначений = ПроверитьРеализациюНаПериод(Период);	
	
	// перезаписываем существующие реализации
	Если ЗначениеЗаполнено(ТаблицаЗначений) Тогда
		Для каждого стрТЗ из ТаблицаЗначений цикл
			Объект = стрТЗ.Ссылка.ПолучитьОбъект();
			Объект.ВыполнитьАвтозаполнение();
			Объект.Записать();  
			Сообщить("Документ перезаписан " + стрТЗ.Ссылка); 
			МассивВозврат.Добавить(стрТЗ.Ссылка); 		
		КонецЦикла;
		
	КонецЕсли;
	
	Таблица = СозданиеНовыхРеализаций(Период); 
	 	
	Если ЗначениеЗаполнено (Таблица) Тогда
			
		Для Каждого СтрТаблица Из Таблица Цикл 
			Если ЗначениеЗаполнено(СтрТаблица.Ссылка)  Тогда

			НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			НовыйДокумент.Дата =  Период.ДатаОкончания;
			Контрагент = СтрТаблица.Ссылка.Владелец.ПолучитьОбъект();
			Договор = СтрТаблица.Ссылка.ПолучитьОбъект();
			Организация = СтрТаблица.Ссылка.Организация.ПолучитьОбъект();
			НовыйДокумент.Контрагент = Контрагент.Ссылка;
			НовыйДокумент.Договор = Договор.Ссылка;
			НовыйДокумент.Организация = Организация.Ссылка; 
			НовыйДокумент.Основание = " ";
			НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);			
			
			НовыйДокумент.ВыполнитьАвтозаполнение();
					
			НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
			
			НовыйДокумент.СуммаДокумента = НовыйДокумент.Товары.Итог("Сумма") + НовыйДокумент.Услуги.Итог("Сумма");
		Иначе Продолжить;
		КонецЕсли;
		
			Если НЕ НовыйДокумент.ПроверитьЗаполнение() Тогда
				Возврат ложь;
			КонецЕсли; 
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный); 
			МассивВозврат.Добавить(НовыйДокумент.Ссылка);
		
        КонецЦикла;	      		
				
	КонецЕсли; 
	УИН =  Новый УникальныйИдентификатор;
	
	АдресВХранилище = ПоместитьВоВременноеХранилище(МассивВозврат, УИН);
    ПараметрыЗпуска = Новый Структура;
    ПараметрыЗапуска.Вставить("АдресМассиваВХранилище", АдресВХранилище);
	
КонецФункции   


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПроверитьРеализациюНаПериод(Период)
	
	НачПериод = Период.ДатаНачала;
	КонПериод = Период.ДатаОкончания;
        
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
        |	РеализацияТоваровУслуг.Договор.Ссылка КАК ДоговорСсылка,
        |	РеализацияТоваровУслуг.Договор.ВидДоговора КАК ДоговорВидДоговора,
        |	РеализацияТоваровУслуг.Основание КАК Основание
        |ИЗ
        |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
        |ГДЕ
        |	НЕ РеализацияТоваровУслуг.ПометкаУдаления
        |	И РеализацияТоваровУслуг.Проведен = ИСТИНА
        |	И РеализацияТоваровУслуг.Договор.ВидДоговора.Ссылка = &Перечисления
        |	И РеализацияТоваровУслуг.Дата <= &КонПериода
        |	И РеализацияТоваровУслуг.Дата >= &НачПериода";

	Запрос.УстановитьПараметр("КонПериода", КонПериод); 
	Запрос.УстановитьПараметр("НачПериода", НачПериод);
    Запрос.УстановитьПараметр("Перечисления", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	
    РезультатЗапроса = Запрос.Выполнить();
    
    Выборка = РезультатЗапроса.Выбрать(); 
	
	ТЗ = РезультатЗапроса.Выгрузить();

	Возврат ТЗ;  
	
КонецФункции

Функция СозданиеНовыхРеализаций(Период)экспорт   
	
	НачПериод = Период.ДатаНачала;
	КонПериод = Период.ДатаОкончания;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Договор.Ссылка КАК ДоговорСсылка,
		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_СписокРеализаций
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Проведен = ИСТИНА
		|	И РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ
		|	И РеализацияТоваровУслуг.Дата >= &НачПериода
		|	И РеализацияТоваровУслуг.Дата <= &КонПериода
		|	И РеализацияТоваровУслуг.Договор.ВидДоговора.Ссылка = &Перечисления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Договор,
		|	ВТ_СписокРеализаций.Ссылка КАК Реализации,
		|	ВТ_СписокРеализаций.ДоговорСсылка КАК ДоговорРеализации
		|ПОМЕСТИТЬ ВТ_СоединениеДоговоров
		|ИЗ
		|	ВТ_СписокРеализаций КАК ВТ_СписокРеализаций
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ПО ВТ_СписокРеализаций.ДоговорСсылка = ДоговорыКонтрагентов.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
		|	ВТ_СоединениеДоговоров.ДоговорРеализации КАК ДоговорРеализации,
		|	ВТ_СоединениеДоговоров.Реализации КАК Реализации,
		|	ЕСТЬNULL(ВТ_СоединениеДоговоров.ДоговорРеализации <> ДоговорыКонтрагентов.Ссылка, ИСТИНА) КАК Равны
		|ИЗ
		|	ВТ_СоединениеДоговоров КАК ВТ_СоединениеДоговоров
		|		ПОЛНОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ПО ВТ_СоединениеДоговоров.ДоговорРеализации = ДоговорыКонтрагентов.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ДоговорыКонтрагентов.Ссылка,
		|	ВТ_СоединениеДоговоров.ДоговорРеализации,
		|	ВТ_СоединениеДоговоров.Реализации";
	
	Запрос.УстановитьПараметр("Перечисления", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	Запрос.УстановитьПараметр("КонПериода", КонПериод); 
	Запрос.УстановитьПараметр("НачПериода", НачПериод);

	
	РезультатЗапроса = Запрос.Выполнить();
	Таблица = РезультатЗапроса.Выгрузить();
	
	Возврат Таблица;

	
КонецФункции 

#КонецОбласти
