
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Создать(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.ВКМ_Период) Тогда 
		Сообщить("Не заполнен период"); 
		Возврат; 
	КонецЕсли;   
	
	Период = Объект.ВКМ_Период;
	
	ДоговорыКонтрагентов =  ПолучитьДоговорыКонтрагентов();
	ЗаписатьДоговорыВТабличнуюЧасть(ДоговорыКонтрагентов);  
	
	ДлительнаяОперация =  ВыполнитьФоновоеЗаданиеНаСервере (Период, ДоговорыКонтрагентов);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания (ЭтаФорма); 

	ОписаниеОЗавершении = Новый ОписаниеОповещения ("ОписаниеОЗавершении", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОписаниеОЗавершении, ПараметрыОжидания);

КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте 
Процедура  ОписаниеОЗавершении (Результат,ДополнительныеПараметры) экспорт
	
	Результат = ПолучитьИЗВременногоХранилища (Результат.АдресРезультата);
	
	Если Результат = неопределено тогда 
		Возврат;
	КонецЕсли;  
	
	Если Результат = "Ошибка" Тогда
    СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
    Возврат;
	КонецЕсли;
КонецПроцедуры

  &НаСервере
Процедура ЗаписатьДоговорыВТабличнуюЧасть(ДоговорыКонтрагентов) 
	
	 Если ДоговорыКонтрагентов.Количество() > 0 Тогда 
        Для Каждого Договор Из ДоговорыКонтрагентов Цикл
            НоваяСтрока = Объект.Список.Добавить(); 
            НоваяСтрока.Договор = Договор; 
        КонецЦикла; 
	 КонецЕсли;
	 
КонецПроцедуры
	 

&НаСервере
 Функция ПолучитьДоговорыКонтрагентов()
    	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ВидДоговора.Ссылка = &Перечисления"; 
	Запрос.УстановитьПараметр("Перечисления", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();  
	ТЗ = РезультатЗапроса.Выгрузить();
	
	МассивДоговоров = Новый Массив; 
	
	Пока Выборка.Следующий() Цикл
		МассивДоговоров.Добавить(Выборка.Ссылка);
	КонецЦикла;  
	
	Возврат МассивДоговоров;  
КонецФункции

&НаСервере
 Процедура ЗаполнитьТабличнуюЧастьСсылкой(Результат) 
	 
	 Таблица = Объект.Список;
	 
	 Для каждого стр из Таблица цикл 
		 Для Каждого Элемента Из Результат Цикл
			 Если Стр.Договор = Элемента.Договор Тогда
			 Стр.СсылкаНадоговор = Элемента.Ссылка;
			 КонецЕсли;
		 КонецЦикла;
	 КонецЦикла; 	
		
КонецПроцедуры


&НаСервере
Функция ВыполнитьФоновоеЗаданиеНаСервере (Период, ДоговорыКонтрагентов) экспорт    
	ПараметрыВыполнения = Новый Структура;
	
	ПараметрыЗапуска = Новый Структура("ПараметрыВыполнения", ПараметрыВыполнения);  
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор,"ВКМ_ГрупповоеСозданиеРеализаций.СозданиеРеализаций",Период, ДоговорыКонтрагентов, ПараметрыЗапуска); 
	
	Результат = ПолучитьИЗВременногоХранилища (ПараметрыЗапуска.АдресМассиваВХранилище);  
	
	ЗаполнитьТабличнуюЧастьСсылкой(Результат);

	Возврат ДлительнаяОперация;
                
КонецФункции  

&НаСервере
Функция ТаблицаЗначенийВМассив(ТаблицаЗначений) Экспорт  // Заполняем таблицу Список
    
    Массив = Новый Массив();
    СтруктураСтрокой = "";
    НужнаЗапятая = Ложь;
    Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл
        Если НужнаЗапятая Тогда
            СтруктураСтрокой = СтруктураСтрокой + ",";
        КонецЕсли;
        СтруктураСтрокой = СтруктураСтрокой + Колонка.Имя;
        НужнаЗапятая = Истина;
    КонецЦикла;
    Для Каждого Строка Из ТаблицаЗначений Цикл
        НоваяСтрока = Новый Структура(СтруктураСтрокой);
        ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
        Массив.Добавить(НоваяСтрока);
    КонецЦикла;
    Возврат Массив;

КонецФункции

&НаКлиенте
Процедура ОбработатьДанные(Результат, ЛогЗагрузки) Экспорт
  ЗаполнитьРеализацииНаСервере(); 
    А=1;    
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьРеализацииНаСервере() 
	НачПериод = Объект.ВКМ_Период.ДатаНачала;
	КонПериод = Объект.ВКМ_Период.ДатаОкончания;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Договор,
	|	РеализацияТоваровУслуг.Ссылка КАК Реализация
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО РеализацияТоваровУслуг.Договор = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	НЕ ДоговорыКонтрагентов.ПометкаУдаления
	|	И РеализацияТоваровУслуг.Дата <= &НачПериода
	|	И РеализацияТоваровУслуг.Дата >= &КонПериода
	|	И РеализацияТоваровУслуг.Проведен = ИСТИНА";
	
	Запрос.УстановитьПараметр("КонПериода", КонПериод); 
	Запрос.УстановитьПараметр("НачПериода", НачПериод); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();  
	Таблица = РезультатЗапроса.Выгрузить();
	
	ТЗ = Новый ТаблицаЗначений; 
	ТЗ.Колонки.Добавить("Договор"); 
	ТЗ.Колонки.Добавить("Реализация"); 
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТЗ.Добавить();
		НоваяСтрока.Договор = Выборка.Договор; 
		НоваяСтрока.Реализация = Выборка.Реализация;
	КонецЦикла;  
	
	Для Каждого Строка Из Объект.Список Цикл
		СтрокаТЗ = ТЗ.Найти(Строка.Договор);
		Если ЗначениеЗаполнено(СтрокаТЗ) Тогда
			Строка.Реализация = СтрокаТЗ.Реализация;
		КонецЕсли; 
	КонецЦикла; 

КонецПроцедуры;  

	
#КонецОбласти

