
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Создать(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.ВКМ_Период) Тогда 
		Сообщить("Не заполнен период"); 
		Возврат; 
	КонецЕсли;   
	
	Период = Объект.ВКМ_Период;
	
	ДоговорыКонтрагентов =  ПолучитьДоговорыКонтрагентов(Период);
	ЗаписатьДоговорыВТабличнуюЧасть(ДоговорыКонтрагентов);  
	
	ДлительнаяОперация =  ВыполнитьФоновоеЗаданиеНаСервере (Период);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания (ЭтаФорма); 

	ОписаниеОЗавершении = Новый ОписаниеОповещения ("ОписаниеОЗавершении", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОписаниеОЗавершении, ПараметрыОжидания); 

КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте 
Процедура  ОписаниеОЗавершении (Результат, ПараметрыОжидания) экспорт
	
	Данные = ПолучитьИЗВременногоХранилища (Результат.АдресРезультата);
  
  Если Результат = неопределено тогда 
	  Возврат;
  КонецЕсли;  
  
  Если Результат = "Ошибка" Тогда
	  СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
	  Возврат;
  КонецЕсли; 
  
  ЗаполнитьТабличнуюЧастьСсылкой(Данные);

КонецПроцедуры

  &НаСервере
Процедура ЗаписатьДоговорыВТабличнуюЧасть(ДоговорыКонтрагентов) 
	
	Если ДоговорыКонтрагентов.Количество() > 0 Тогда 
	    Для Каждого Договор Из ДоговорыКонтрагентов Цикл
	        НоваяСтрока = Объект.Список.Добавить(); 
	        НоваяСтрока.Договор = Договор.Ссылка; 
	    КонецЦикла; 
	КонецЕсли;

	 
КонецПроцедуры
	 

&НаСервере
 Функция ПолучитьДоговорыКонтрагентов(Период)
    	НачПериод = Период.ДатаНачала;
	КонПериод = Период.ДатаОкончания;

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы КАК ВКМ_ВыполненныеКлиентуРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ВКМ_ВыполненныеКлиентуРаботы.ВКМ_Договор = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	ДоговорыКонтрагентов.ВидДоговора.Ссылка = &Перечисления
	|	И ДоговорыКонтрагентов.ВКМ_НачПериод <= &НачПериод
	|	И ВКМ_ВыполненныеКлиентуРаботы.Период МЕЖДУ &НачПериод И &КонПериод
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоговорыКонтрагентов.Ссылка"; 
	Запрос.УстановитьПараметр("Перечисления", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	Запрос.УстановитьПараметр("НачПериод", НачПериод);
	Запрос.УстановитьПараметр("КонПериод", КонПериод);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();  
	ТЗ = РезультатЗапроса.Выгрузить();
	
	МассивДоговоров = Новый Массив; 

	Пока Выборка.Следующий() Цикл 
		МассивДоговоров.Добавить(Выборка.Ссылка); 
	КонецЦикла;  
	
	Возврат МассивДоговоров;  
КонецФункции

&НаСервере
 Процедура ЗаполнитьТабличнуюЧастьСсылкой(Результат) 
	 
	Таблица = Объект.Список;
	 
	 Для каждого стр из Таблица цикл 
	     Для Каждого Элемента Из Результат Цикл
	    	 Если Стр.Договор = Элемента.Договор Тогда
	    	 Стр.СсылкаНадоговор = Элемента.Реализация;
	    	 КонецЕсли;
	     КонецЦикла;
	 КонецЦикла; 
		
КонецПроцедуры


&НаСервере
Функция ВыполнитьФоновоеЗаданиеНаСервере (Период) экспорт    
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор,"ВКМ_ГрупповоеСозданиеРеализаций.СозданиеРеализаций",Период); 
		
	Возврат ДлительнаяОперация;

                
КонецФункции  

&НаСервере
Функция ТаблицаЗначенийВМассив(ТаблицаЗначений) Экспорт  // Заполняем таблицу Список
    
   Массив = Новый Массив();
	СтруктураСтрокой = "";
	НужнаЗапятая = Ложь;
	Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл
	    Если НужнаЗапятая Тогда
	        СтруктураСтрокой = СтруктураСтрокой + ",";
	    КонецЕсли;
	    СтруктураСтрокой = СтруктураСтрокой + Колонка.Имя;
	    НужнаЗапятая = Истина;
	КонецЦикла;
	Для Каждого Строка Из ТаблицаЗначений Цикл
	    НоваяСтрока = Новый Структура(СтруктураСтрокой);
	    ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	    Массив.Добавить(НоваяСтрока);
	КонецЦикла;
	Возврат Массив;


КонецФункции

#КонецОбласти

