
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Создать(Команда)
	 Если НЕ ЗначениеЗаполнено(Объект.ВКМ_Период) Тогда 
        Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не заполнен период";
			Сообщение.Сообщить(); 
        Возврат; 
	КонецЕсли;   
	
	 ДоговорыКонтрагентов =  ПолучитьДоговорыКонтрагентов();
	 ЗаписатьДоговорыВТабличнуюЧасть(ДоговорыКонтрагентов);
	
    // --> алгоритм должен выполняться с использованием механизма длительных операций БСП
    ПараметрыВыполнения = Новый Структура;
    ЛогЗагрузки = ""; 
    
    ПараметрыЗапуска = Новый Структура("ПараметрыВыполнения", ПараметрыВыполнения);     

    СтруктураФоновогоЗадания = СоздатьРеализацииНаСервере(ПараметрыЗапуска, УникальныйИдентификатор);
    ИДЗадания   = СтруктураФоновогоЗадания.ИдентификаторЗадания;
    ИдентификаторЗадания = СтруктураФоновогоЗадания.ИдентификаторЗадания;  
	
    ПараметрыОжидания  = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
    ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
    ПараметрыОжидания.Интервал     = 1;
    
    ДлительныеОперацииКлиент.ОжидатьЗавершение(СтруктураФоновогоЗадания, Новый ОписаниеОповещения("ОбработатьДанные", ЭтотОбъект, ЛогЗагрузки), ПараметрыОжидания);

КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции


&НаСервере
Процедура ЗаписатьДоговорыВТабличнуюЧасть(ДоговорыКонтрагентов)
	
	 Если ДоговорыКонтрагентов.Количество() > 0 Тогда 
        Для Каждого Договор Из ДоговорыКонтрагентов Цикл
            НоваяСтрока = Объект.Список.Добавить(); 
            НоваяСтрока.Договор = Договор; 
        КонецЦикла; 
    КонецЕсли;

	
КонецПроцедуры 

 Функция ПолучитьДоговорыКонтрагентов()
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |	ДоговорыКонтрагентов.Ссылка КАК Ссылка
        |ИЗ
        |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
        |		ПОЛНОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
        |		ПО РеализацияТоваровУслуг.Договор.Ссылка <> ДоговорыКонтрагентов.Владелец.Ссылка
        |ГДЕ
        |	НЕ ДоговорыКонтрагентов.ПометкаУдаления
        |	И РеализацияТоваровУслуг.Договор.Ссылка <> ДоговорыКонтрагентов.Ссылка";
    
    РезультатЗапроса = Запрос.Выполнить();
    
    Выборка = РезультатЗапроса.Выбрать(); 
	Таблица = РезультатЗапроса.Выгрузить();
    
    МассивДоговоров = Новый Массив; 
    
    Пока Выборка.Следующий() Цикл
        МассивДоговоров.Добавить(Выборка.Ссылка);
    КонецЦикла;  
    
    Возврат МассивДоговоров;     
    
КонецФункции

&НаСервере
Функция СоздатьРеализацииНаСервере(ПараметрыЗапуска, УникальныйИдентификатор)
        
    НаименованиеЗадания = "Запуск длительной операции";
    ВыполняемыйМетод = "ВКМ_ГрупповоеСозданиеРеализаций.СозданиеРеализаций"; 
    ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
    ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	МассивДанных = Новый Массив; 
	СтруктураРеквизитов = Новый Структура("Период", Объект.ВКМ_Период); 
	МассивДанных.Добавить(СтруктураРеквизитов);
	Таблица = Объект.Список.Выгрузить();  
	ТаблицаРеквизитов = Новый ТаблицаЗначений; 
	ТаблицаРеквизитов.Колонки.Добавить("Организация");
	ТаблицаРеквизитов.Колонки.Добавить("Контрагент");
	ТаблицаРеквизитов.Колонки.Добавить("Договор");
	
	Для Каждого СтрТЗ из Таблица Цикл
		ДоговорСсылка = СтрТЗ.Договор;
		ОбъектДоговор = ДоговорСсылка.ПолучитьОбъект();  
		
		НоваяСтрока = СтруктураРеквизитов.Добавить(); 
		НоваяСтрока.Организация = ОбъектДоговор.Организация;
		НоваяСтрока.Контрагент = ОбъектДоговор.Владелец;
		НоваяСтрока.Договор = ОбъектДоговор;
		
		МассивСтруктур = ТаблицаЗначенийВМассив(ТаблицаРеквизитов);
		МассивДанных.Добавить(МассивСтруктур); 
		ПараметрыЗапуска.Вставить("ДанныеОбъекта", МассивДанных);
	КонецЦикла;
	
    СтруктураФоновогоЗадания = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ВыполняемыйМетод, ПараметрыЗапуска.ПараметрыВыполнения, ПараметрыЗапуска.ДанныеОбъекта);
        
КонецФункции  

Функция ТаблицаЗначенийВМассив(ТаблицаЗначений) Экспорт  // Заполняем таблицу Список
    
    Массив = Новый Массив();
    СтруктураСтрокой = "";
    НужнаЗапятая = Ложь;
    Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл
        Если НужнаЗапятая Тогда
            СтруктураСтрокой = СтруктураСтрокой + ",";
        КонецЕсли;
        СтруктураСтрокой = СтруктураСтрокой + Колонка.Имя;
        НужнаЗапятая = Истина;
    КонецЦикла;
    Для Каждого Строка Из ТаблицаЗначений Цикл
        НоваяСтрока = Новый Структура(СтруктураСтрокой);
        ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
        Массив.Добавить(НоваяСтрока);
    КонецЦикла;
    Возврат Массив;

КонецФункции

&НаКлиенте
Процедура ОбработатьДанные(Результат, ЛогЗагрузки) Экспорт
  ЗаполнитьРеализацииНаСервере(); 
    А=1;    
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьРеализацииНаСервере() 
	НачПериод = Объект.ВКМ_Период.ДатаНачала;
	КонПериод = Объект.ВКМ_Период.ДатаОкончания;
	
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |	ДоговорыКонтрагентов.Ссылка КАК Договор,
        |	РеализацияТоваровУслуг.Ссылка КАК Реализация
        |ИЗ
        |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
        |		ПО РеализацияТоваровУслуг.Договор = ДоговорыКонтрагентов.Ссылка
        |ГДЕ
        |	НЕ ДоговорыКонтрагентов.ПометкаУдаления
        |	И РеализацияТоваровУслуг.Дата <= &НачПериода
        |	И РеализацияТоваровУслуг.Дата >= &КонПериода";
    
    Запрос.УстановитьПараметр("КонПериода", КонПериод); 
    Запрос.УстановитьПараметр("НачПериода", НачПериод); 
    
    РезультатЗапроса = Запрос.Выполнить();
    
    Выборка = РезультатЗапроса.Выбрать();  
	Таблица = РезультатЗапроса.Выгрузить();
    
    Таблица = Новый ТаблицаЗначений; 
    Таблица.Колонки.Добавить("Договор"); 
    Таблица.Колонки.Добавить("Реализация"); 
    
    Пока Выборка.Следующий() Цикл
        НоваяСтрока = Таблица.Добавить();
        НоваяСтрока.Договор = Выборка.Договор; 
        НоваяСтрока.Реализация = Выборка.Реализация;
    КонецЦикла;  
    
    Для Каждого Строка Из Объект.Список Цикл
        СтрокаТЗ = Таблица.Найти(Строка.Договор);
        Если ЗначениеЗаполнено(СтрокаТЗ) Тогда
            Строка.Реализация = СтрокаТЗ.Реализация;
        КонецЕсли; 
    КонецЦикла; 
 КонецПроцедуры;
	
#КонецОбласти

